In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\landing\\staffs.csv")
df.head(10)

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id,Extraction_Date,source
0,1,Fabiola,Jackson,fabiola.jackson@bikes.shop,NaN,1,NaN,NaN,1.714564e+09,datalack
1,2,Mireya,NaN,mireya.copeland@bikes.shop,(831) 555-5555,1,1.0,1.0,1.714564e+09,datalack
2,3,Genna,Serrano,genna.serrano@bikes.shop,(831) 555-5556,1,1.0,2.0,1.714564e+09,datalack
3,4,Virgie,Wiggins,virgie.wiggins@bikes.shop,(831) 555-5557,1,1.0,2.0,1.714564e+09,datalack
4,5,Jannette,David,jannette.david@bikes.shop,(516) 379-4444,1,2.0,1.0,1.714564e+09,datalack
5,6,Marcelene,Boyer,NaN,(516) 379-4445,1,2.0,5.0,1.714564e+09,datalack
6,7,Venita,Daniel,venita.daniel@bikes.shop,NaN,1,2.0,5.0,1.714564e+09,datalack
7,8,Kali,Vargas,kali.vargas@bikes.shop,(972) 530-5555,1,3.0,1.0,1.714564e+09,datalack
8,9,Layla,Terrell,layla.terrell@bikes.shop,(972) 530-5556,1,3.0,7.0,1.714564e+09,datalack
9,10,Bernardine,Houston,bernardine.houston@bikes.shop,(972) 530-5557,1,3.0,7.0,1.714564e+09,datalack

# Check for Missing Values

In [4]:
df.isna().sum()

staff_id           0
first_name         0
last_name          1
email              1
phone              2
active             0
store_id           1
manager_id         1
Extraction_Date    0
source             0
dtype: int64

In [5]:
df.dropna(inplace=True)
df.isna().sum()

staff_id           0
first_name         0
last_name          0
email              0
phone              0
active             0
store_id           0
manager_id         0
Extraction_Date    0
source             0
dtype: int64

# Check for datatypes

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 2 to 9
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   staff_id         6 non-null      int64
 1   first_name       6 non-null      object
 2   last_name        6 non-null      object
 3   email            6 non-null      object
 4   phone            6 non-null      object
 5   active           6 non-null      int64
 6   store_id         6 non-null      float64
 7   manager_id       6 non-null      float64
 8   Extraction_Date  6 non-null      float64
 9   source           6 non-null      object
dtypes: float64(3), int64(2), object(5)
memory usage: 528.0+ bytes

In [7]:
# Convert store_id and manager_id into integers 
df[['store_id', 'manager_id']] = df[['store_id', 'manager_id']].astype(int)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 2 to 9
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   staff_id         6 non-null      int64
 1   first_name       6 non-null      object
 2   last_name        6 non-null      object
 3   email            6 non-null      object
 4   phone            6 non-null      object
 5   active           6 non-null      int64
 6   store_id         6 non-null      int32
 7   manager_id       6 non-null      int32
 8   Extraction_Date  6 non-null      float64
 9   source           6 non-null      object
dtypes: float64(1), int32(2), int64(2), object(5)
memory usage: 480.0+ bytes

In [11]:
# Convert current_timestamp column to datetime
df['Extraction_Date'] = pd.to_datetime(df['Extraction_Date'], unit='s')
df.head()

,staff_id,first_name,last_name,email,phone,active,store_id,manager_id,Extraction_Date,source
2,3,Genna,Serrano,genna.serrano@bikes.shop,(831) 555-5556,1,1,2,2024-05-01 11:42:23.564626217,datalack
3,4,Virgie,Wiggins,virgie.wiggins@bikes.shop,(831) 555-5557,1,1,2,2024-05-01 11:42:23.564626217,datalack
4,5,Jannette,David,jannette.david@bikes.shop,(516) 379-4444,1,2,1,2024-05-01 11:42:23.564626217,datalack
7,8,Kali,Vargas,kali.vargas@bikes.shop,(972) 530-5555,1,3,1,2024-05-01 11:42:23.564626217,datalack
8,9,Layla,Terrell,layla.terrell@bikes.shop,(972) 530-5556,1,3,7,2024-05-01 11:42:23.564626217,datalack

# Check for Duplicates

In [12]:
duplicates = df.duplicated(subset=['staff_id'])
duplicates

2    False
3    False
4    False
7    False
8    False
9    False
dtype: bool

In [13]:
df.to_csv("D:\\ITI\\Python\\ITI_Python_for_Data_Management\\Extraction\\Staging\\staffs\\staffs.csv")